* Company
Autocompletion
#+BEGIN_SRC emacs-lisp
(straight-use-package 'company)
(require 'company)

(define-key company-active-map "\C-n" 'company-select-next)
(define-key company-active-map "\C-p" 'company-select-previous)
(setq company-idle-delay 0.5)
#+END_SRC

#+RESULTS:
: 0.5

** Rust
#+BEGIN_SRC emacs-lisp
;;(straight-use-package 'racer)
(straight-use-package 'rust-mode)
(setq rust-indent-offset 2)
(require 'rust-mode)
(add-hook 'rust-mode-hook #'lsp-deferred)
;;(add-hook 'racer-mode-hook #'eldoc-mode)
;;(add-hook 'racer-mode-hook #'company-mode)


;;(setq company-tooltip-align-annotations t)
;;(setq racer-rust-src-path "/usr/local/google/home/liurnd/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src")
(setq lsp-rust-rls-server-command "/Users/liurnd/.cargo/bin/rls")
#+END_SRC

#+RESULTS:
: /Users/liurnd/.cargo/bin/rls

